# Selecting and Grouping Data

# 1. Selecting Variables and Individuals

#### Using `loc`
The `loc` indexer is used for label-based indexing. It allows you to select rows and columns by labels or boolean arrays.

In [10]:
import pandas as pd

# Example DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [24, 27, 22, 29],
        'Score': [85.5, 90.0, 87.5, 88.0]}

df = pd.DataFrame(data)

df

      Name  Age  Score
0    Alice   24   85.5
1      Bob   27   90.0
2  Charlie   22   87.5
3    David   29   88.0

In [11]:
# Selecting rows by label
selected_rows = df.loc[0:2]
selected_rows

      Name  Age  Score
0    Alice   24   85.5
1      Bob   27   90.0
2  Charlie   22   87.5

In [12]:
# Selecting specific rows and columns by label
selected_data = df.loc[0:2, ['Name', 'Score']]
selected_data

      Name  Score
0    Alice   85.5
1      Bob   90.0
2  Charlie   87.5

In [13]:
# Boolean indexing with loc
selected_rows_boolean = df.loc[df['Age'] > 25]
selected_rows_boolean

    Name  Age  Score
1    Bob   27   90.0
3  David   29   88.0

#### Using `iloc`

The `iloc` indexer is used for positional indexing. It allows you to select rows and columns by their integer positions.

In [14]:
# Selecting rows by position
selected_rows_pos = df.iloc[0:2]
selected_rows_pos

    Name  Age  Score
0  Alice   24   85.5
1    Bob   27   90.0

In [15]:
# Selecting specific rows and columns by position
selected_data_pos = df.iloc[0:2, [0, 2]]
selected_data_pos

# Boolean indexing with iloc is not straightforward; typically loc is used for boolean indexing

    Name  Score
0  Alice   85.5
1    Bob   90.0

# 2. Grouping Variables

#### Using `groupby`

The `groupby` method is used to group data by one or more columns and apply aggregate functions to each group.

In [16]:
# Example DataFrame for grouping
data = {'Team': ['A', 'B', 'A', 'B'],
        'Player': ['Alice', 'Bob', 'Charlie', 'David'],
        'Score': [85.5, 90.0, 87.5, 88.0]}

df_group = pd.DataFrame(data)

In [19]:
# Grouping by a single column
grouped = df_group.groupby('Team')
grouped.mean(numeric_only=True)

      Score
Team
A      86.5
B      89.0

In [20]:
# Grouping by multiple columns
grouped_multiple = df_group.groupby(['Team', 'Player'])
grouped_multiple.mean()

              Score
Team Player
A    Alice     85.5
     Charlie   87.5
B    Bob       90.0
     David     88.0

#### Using `pivot_table`

The `pivot_table` function creates a spreadsheet-style pivot table as a DataFrame. It aggregates data and can include summary statistics.

In [21]:
# Example DataFrame for pivot table
data = {'Team': ['A', 'B', 'A', 'B'],
        'Player': ['Alice', 'Bob', 'Charlie', 'David'],
        'Score': [85.5, 90.0, 87.5, 88.0],
        'Age': [24, 27, 22, 29]}

df_pivot = pd.DataFrame(data)

df_pivot

  Team   Player  Score  Age
0    A    Alice   85.5   24
1    B      Bob   90.0   27
2    A  Charlie   87.5   22
3    B    David   88.0   29

In [22]:
# Creating a pivot table
pivot = df_pivot.pivot_table(values='Score', index='Team', columns='Player', aggfunc='mean')
pivot

Player  Alice   Bob  Charlie  David
Team
A        85.5   NaN     87.5    NaN
B         NaN  90.0      NaN   88.0

In [23]:
# Pivot table with multiple aggregation functions
pivot_multi = df_pivot.pivot_table(values='Score', index='Team', columns='Player', aggfunc=[min, max])
pivot_multi

         min                       max
Player Alice   Bob Charlie David Alice   Bob Charlie David
Team
A       85.5   NaN    87.5   NaN  85.5   NaN    87.5   NaN
B        NaN  90.0     NaN  88.0   NaN  90.0     NaN  88.0

# 3. Conditional Filtering

#### Using `query`

The `query` method allows you to filter DataFrames using a query string, which can be more readable than boolean indexing.

In [24]:
# Example DataFrame for query
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [24, 27, 22, 29],
        'Score': [85.5, 90.0, 87.5, 88.0]}

df_query = pd.DataFrame(data)

df_query

      Name  Age  Score
0    Alice   24   85.5
1      Bob   27   90.0
2  Charlie   22   87.5
3    David   29   88.0

In [25]:
# Filtering with a query string
filtered_df = df_query.query('Age > 25')
filtered_df

    Name  Age  Score
1    Bob   27   90.0
3  David   29   88.0

In [26]:
# Combining conditions in query
filtered_combined = df_query.query('Age > 25 and Score > 88')
filtered_combined

  Name  Age  Score
1  Bob   27   90.0